Ran Plan for project: `myworkflow` dir: `.` workspace: `myworkflow`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading git::https://github.com/aws-ia/terraform-aws-eks-blueprints.git?ref=v4.25.0 for eks_blueprints...
- eks_blueprints in .terraform/modules/eks_blueprints
Downloading registry.terraform.io/terraform-aws-modules/eks/aws 18.29.1 for eks_blueprints.aws_eks...
- eks_blueprints.aws_eks in .terraform/modules/eks_blueprints.aws_eks
- eks_blueprints.aws_eks.eks_managed_node_group in .terraform/modules/eks_blueprints.aws_eks/modules/eks-managed-node-group
- eks_blueprints.aws_eks.eks_managed_node_group.user_data in .terraform/modules/eks_blueprints.aws_eks/modules/_user_data
- eks_blueprints.aws_eks.fargate_profile in .terraform/modules/eks_blueprints.aws_eks/modules/fargate-profile
Downloading registry.terraform.io/terraform-aws-modules/kms/aws 1.0.2 for eks_blueprints.aws_eks.kms...
- eks_blueprints.aws_eks.kms in .terraform/modules/eks_blueprints.aws_eks.kms
- eks_blueprints.aws_eks.self_managed_node_group in .terraform/modules/eks_blueprints.aws_eks/modules/self-managed-node-group
- eks_blueprints.aws_eks.self_managed_node_group.user_data in .terraform/modules/eks_blueprints.aws_eks/modules/_user_data
- eks_blueprints.aws_eks_fargate_profiles in .terraform/modules/eks_blueprints/modules/aws-eks-fargate-profiles
- eks_blueprints.aws_eks_managed_node_groups in .terraform/modules/eks_blueprints/modules/aws-eks-managed-node-groups
- eks_blueprints.aws_eks_self_managed_node_groups in .terraform/modules/eks_blueprints/modules/aws-eks-self-managed-node-groups
- eks_blueprints.aws_eks_self_managed_node_groups.launch_template_self_managed_ng in .terraform/modules/eks_blueprints/modules/launch-templates
- eks_blueprints.aws_eks_teams in .terraform/modules/eks_blueprints/modules/aws-eks-teams
- eks_blueprints.emr_on_eks in .terraform/modules/eks_blueprints/modules/emr-on-eks
- eks_blueprints.kms in .terraform/modules/eks_blueprints/modules/aws-kms
Downloading git::https://github.com/aws-ia/terraform-aws-eks-blueprints.git?ref=v4.25.0 for kubernetes_addons...
- kubernetes_addons in .terraform/modules/kubernetes_addons/modules/kubernetes-addons
- kubernetes_addons.adot_collector_haproxy in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/adot-collector-haproxy
- kubernetes_addons.adot_collector_haproxy.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.adot_collector_haproxy.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.adot_collector_java in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/adot-collector-java
- kubernetes_addons.adot_collector_java.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.adot_collector_java.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.adot_collector_memcached in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/adot-collector-memcached
- kubernetes_addons.adot_collector_memcached.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.adot_collector_memcached.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.adot_collector_nginx in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/adot-collector-nginx
- kubernetes_addons.adot_collector_nginx.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.adot_collector_nginx.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.agones in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/agones
- kubernetes_addons.agones.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.agones.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.airflow in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/airflow
- kubernetes_addons.airflow.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.airflow.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.app_2048 in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/app-2048
- kubernetes_addons.appmesh_controller in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/appmesh-controller
- kubernetes_addons.appmesh_controller.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.appmesh_controller.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.argo_rollouts in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/argo-rollouts
- kubernetes_addons.argo_rollouts.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.argo_rollouts.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.argo_workflows in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/argo-workflows
- kubernetes_addons.argo_workflows.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.argo_workflows.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.argocd in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/argocd
- kubernetes_addons.argocd.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.argocd.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_cloudwatch_metrics in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-cloudwatch-metrics
- kubernetes_addons.aws_cloudwatch_metrics.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_cloudwatch_metrics.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_coredns in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-coredns
- kubernetes_addons.aws_coredns.cluster_proportional_autoscaler in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cluster-proportional-autoscaler
- kubernetes_addons.aws_coredns.cluster_proportional_autoscaler.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_coredns.cluster_proportional_autoscaler.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_coredns.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_coredns.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_ebs_csi_driver in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-ebs-csi-driver
- kubernetes_addons.aws_ebs_csi_driver.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_ebs_csi_driver.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_ebs_csi_driver.irsa_addon in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_efs_csi_driver in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-efs-csi-driver
- kubernetes_addons.aws_efs_csi_driver.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_efs_csi_driver.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_for_fluent_bit in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-for-fluentbit
- kubernetes_addons.aws_for_fluent_bit.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_for_fluent_bit.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_for_fluent_bit.kms in .terraform/modules/kubernetes_addons/modules/aws-kms
- kubernetes_addons.aws_fsx_csi_driver in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-fsx-csi-driver
- kubernetes_addons.aws_fsx_csi_driver.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_fsx_csi_driver.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_kube_proxy in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-kube-proxy
- kubernetes_addons.aws_load_balancer_controller in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-load-balancer-controller
- kubernetes_addons.aws_load_balancer_controller.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_load_balancer_controller.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_node_termination_handler in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-node-termination-handler
- kubernetes_addons.aws_node_termination_handler.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_node_termination_handler.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_privateca_issuer in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-privateca-issuer
- kubernetes_addons.aws_privateca_issuer.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.aws_privateca_issuer.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.aws_vpc_cni in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/aws-vpc-cni
- kubernetes_addons.aws_vpc_cni.irsa_addon in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.calico in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/calico
- kubernetes_addons.calico.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.calico.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.cert_manager in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cert-manager
- kubernetes_addons.cert_manager.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.cert_manager.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.cert_manager_csi_driver in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cert-manager-csi-driver
- kubernetes_addons.cert_manager_csi_driver.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.cert_manager_csi_driver.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.cert_manager_istio_csr in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cert-manager-istio-csr
- kubernetes_addons.cert_manager_istio_csr.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.cert_manager_istio_csr.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.chaos_mesh in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/chaos-mesh
- kubernetes_addons.chaos_mesh.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.chaos_mesh.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.cilium in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cilium
- kubernetes_addons.cilium.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.cilium.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.cluster_autoscaler in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cluster-autoscaler
- kubernetes_addons.cluster_autoscaler.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.cluster_autoscaler.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.consul in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/consul
- kubernetes_addons.consul.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.consul.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.coredns_autoscaler in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cluster-proportional-autoscaler
- kubernetes_addons.coredns_autoscaler.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.coredns_autoscaler.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.crossplane in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/crossplane
- kubernetes_addons.crossplane.aws_provider_irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.crossplane.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.crossplane.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.crossplane.jet_aws_provider_irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.crossplane.upbound_aws_provider_irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.csi_secrets_store_provider_aws in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/csi-secrets-store-provider-aws
- kubernetes_addons.csi_secrets_store_provider_aws.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.csi_secrets_store_provider_aws.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.datadog_operator in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/datadog-operator
- kubernetes_addons.datadog_operator.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.datadog_operator.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.emr_on_eks in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/emr-on-eks
- kubernetes_addons.external_dns in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/external-dns
- kubernetes_addons.external_dns.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.external_dns.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.external_secrets in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/external-secrets
- kubernetes_addons.external_secrets.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.external_secrets.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.fargate_fluentbit in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/fargate-fluentbit
- kubernetes_addons.gatekeeper in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/gatekeeper
- kubernetes_addons.gatekeeper.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.gatekeeper.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.grafana in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/grafana
- kubernetes_addons.grafana.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.grafana.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.ingress_nginx in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/ingress-nginx
- kubernetes_addons.ingress_nginx.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.ingress_nginx.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.karpenter in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/karpenter
- kubernetes_addons.karpenter.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.karpenter.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.keda in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/keda
- kubernetes_addons.keda.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.keda.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kube_prometheus_stack in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/kube-prometheus-stack
- kubernetes_addons.kube_prometheus_stack.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kube_prometheus_stack.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kube_state_metrics in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/kube-state-metrics
- kubernetes_addons.kube_state_metrics.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kube_state_metrics.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kubecost in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/kubecost
- kubernetes_addons.kubecost.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kubecost.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kuberay_operator in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/kuberay-operator
- kubernetes_addons.kuberay_operator.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kuberay_operator.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kubernetes_dashboard in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/kubernetes-dashboard
- kubernetes_addons.kubernetes_dashboard.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kubernetes_dashboard.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kyverno in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/kyverno
- kubernetes_addons.kyverno.kyverno_helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kyverno.kyverno_helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kyverno.kyverno_policies_helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kyverno.kyverno_policies_helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.kyverno.kyverno_policy_reporter_helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.kyverno.kyverno_policy_reporter_helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.local_volume_provisioner in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/local-volume-provisioner
- kubernetes_addons.local_volume_provisioner.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.local_volume_provisioner.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.metrics_server in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/metrics-server
- kubernetes_addons.metrics_server.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.metrics_server.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.nvidia_device_plugin in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/nvidia-device-plugin
- kubernetes_addons.nvidia_device_plugin.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.nvidia_device_plugin.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
Downloading registry.terraform.io/ondat/ondat-addon/eksblueprints 0.1.2 for kubernetes_addons.ondat...
- kubernetes_addons.ondat in .terraform/modules/kubernetes_addons.ondat
Downloading git::https://github.com/aws-ia/terraform-aws-eks-blueprints.git for kubernetes_addons.ondat.helm_addon...
- kubernetes_addons.ondat.helm_addon in .terraform/modules/kubernetes_addons.ondat.helm_addon/modules/kubernetes-addons/helm-addon
- kubernetes_addons.ondat.helm_addon.irsa in .terraform/modules/kubernetes_addons.ondat.helm_addon/modules/irsa
- kubernetes_addons.opentelemetry_operator in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/opentelemetry-operator
- kubernetes_addons.opentelemetry_operator.cert_manager in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/cert-manager
- kubernetes_addons.opentelemetry_operator.cert_manager.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.opentelemetry_operator.cert_manager.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.opentelemetry_operator.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.opentelemetry_operator.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
Downloading registry.terraform.io/portworx/portworx-addon/eksblueprints 0.0.6 for kubernetes_addons.portworx...
- kubernetes_addons.portworx in .terraform/modules/kubernetes_addons.portworx
Downloading git::https://github.com/aws-ia/terraform-aws-eks-blueprints.git for kubernetes_addons.portworx.helm_addon...
- kubernetes_addons.portworx.helm_addon in .terraform/modules/kubernetes_addons.portworx.helm_addon/modules/kubernetes-addons/helm-addon
- kubernetes_addons.portworx.helm_addon.irsa in .terraform/modules/kubernetes_addons.portworx.helm_addon/modules/irsa
- kubernetes_addons.prometheus in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/prometheus
- kubernetes_addons.prometheus.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.prometheus.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.prometheus.irsa_amp_ingest in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.prometheus.irsa_amp_query in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.promtail in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/promtail
- kubernetes_addons.promtail.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.promtail.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.reloader in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/reloader
- kubernetes_addons.reloader.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.reloader.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.secrets_store_csi_driver in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/secrets-store-csi-driver
- kubernetes_addons.secrets_store_csi_driver.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.secrets_store_csi_driver.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.smb_csi_driver in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/smb-csi-driver
- kubernetes_addons.smb_csi_driver.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.smb_csi_driver.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.spark_history_server in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/spark-history-server
- kubernetes_addons.spark_history_server.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.spark_history_server.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.spark_k8s_operator in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/spark-k8s-operator
- kubernetes_addons.spark_k8s_operator.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.spark_k8s_operator.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.strimzi_kafka_operator in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/strimzi-kafka-operator
- kubernetes_addons.strimzi_kafka_operator.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.strimzi_kafka_operator.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
Downloading registry.terraform.io/sysdiglabs/sysdig-addon/eksblueprints 0.0.3 for kubernetes_addons.sysdig_agent...
- kubernetes_addons.sysdig_agent in .terraform/modules/kubernetes_addons.sysdig_agent
Downloading git::https://github.com/aws-ia/terraform-aws-eks-blueprints.git for kubernetes_addons.sysdig_agent.helm_addon...
- kubernetes_addons.sysdig_agent.helm_addon in .terraform/modules/kubernetes_addons.sysdig_agent.helm_addon/modules/kubernetes-addons/helm-addon
- kubernetes_addons.sysdig_agent.helm_addon.irsa in .terraform/modules/kubernetes_addons.sysdig_agent.helm_addon/modules/irsa
- kubernetes_addons.tetrate_istio in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/tetrate-istio
- kubernetes_addons.tetrate_istio.base in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.tetrate_istio.base.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.tetrate_istio.cni in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.tetrate_istio.cni.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.tetrate_istio.gateway in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.tetrate_istio.gateway.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.tetrate_istio.istiod in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.tetrate_istio.istiod.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.thanos in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/thanos
- kubernetes_addons.thanos.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.thanos.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.traefik in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/traefik
- kubernetes_addons.traefik.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.traefik.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
Downloading registry.terraform.io/hashicorp/hashicorp-vault-eks-addon/aws 1.0.0-rc2 for kubernetes_addons.vault...
- kubernetes_addons.vault in .terraform/modules/kubernetes_addons.vault
- kubernetes_addons.velero in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/velero
- kubernetes_addons.velero.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.velero.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.vpa in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/vpa
- kubernetes_addons.vpa.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.vpa.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
- kubernetes_addons.yunikorn in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/yunikorn
- kubernetes_addons.yunikorn.helm_addon in .terraform/modules/kubernetes_addons/modules/kubernetes-addons/helm-addon
- kubernetes_addons.yunikorn.helm_addon.irsa in .terraform/modules/kubernetes_addons/modules/irsa
Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 3.19.0 for vpc...
- vpc in .terraform/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching ">= 2.6.1, >= 2.10.0, >= 2.17.0"...
- Finding gavinbunney/kubectl versions matching ">= 1.14.0"...
- Finding hashicorp/local versions matching ">= 2.1.0"...
- Finding latest version of hashicorp/random...
- Finding hashicorp/helm versions matching ">= 2.4.1, >= 2.5.1, >= 2.8.0"...
- Finding hashicorp/time versions matching ">= 0.7.0, >= 0.8.0"...
- Finding hashicorp/null versions matching ">= 3.0.0, >= 3.1.0"...
- Finding integrations/github versions matching "~> 5.0"...
- Finding hashicorp/aws versions matching ">= 3.72.0, >= 3.73.0, >= 4.10.0, >= 4.13.0, >= 4.47.0"...
- Finding terraform-aws-modules/http versions matching "2.4.1"...
- Finding hashicorp/tls versions matching ">= 3.0.0"...
- Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
- Installing gavinbunney/kubectl v1.14.0...
- Installed gavinbunney/kubectl v1.14.0 (self-signed, key ID AD64217B5ADD572F)
- Installing hashicorp/local v2.4.0...
- Installed hashicorp/local v2.4.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.9.0...
- Installed hashicorp/helm v2.9.0 (signed by HashiCorp)
- Installing hashicorp/time v0.9.1...
- Installed hashicorp/time v0.9.1 (signed by HashiCorp)
- Installing integrations/github v5.22.0...
- Installed integrations/github v5.22.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing terraform-aws-modules/http v2.4.1...
- Installed terraform-aws-modules/http v2.4.1 (self-signed, key ID B2C1C0641B6B0EB7)
- Installing hashicorp/cloudinit v2.3.2...
- Installed hashicorp/cloudinit v2.3.2 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.19.0...
- Installed hashicorp/kubernetes v2.19.0 (signed by HashiCorp)
- Installing hashicorp/random v3.5.1...
- Installed hashicorp/random v3.5.1 (signed by HashiCorp)
- Installing hashicorp/null v3.2.1...
- Installed hashicorp/null v3.2.1 (signed by HashiCorp)
- Installing hashicorp/aws v4.63.0...
- Installed hashicorp/aws v4.63.0 (signed by HashiCorp)
- Installing hashicorp/tls v4.0.4...
- Installed hashicorp/tls v4.0.4 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "main-module-eu-central-1a"
        }
      + tags_all             = {
          + "Name" = "main-module-eu-central-1a"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main-module"
        }
      + tags_all = {
          + "Name" = "main-module"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "main-module-eu-central-1a"
        }
      + tags_all             = {
          + "Name" = "main-module-eu-central-1a"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-module-private"
        }
      + tags_all         = {
          + "Name" = "main-module-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-module-public"
        }
      + tags_all         = {
          + "Name" = "main-module-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-module-private-eu-central-1a"
        }
      + tags_all                                       = {
          + "Name" = "main-module-private-eu-central-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-module-private-eu-central-1b"
        }
      + tags_all                                       = {
          + "Name" = "main-module-private-eu-central-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                       = "main-module-public-eu-central-1a"
          + "kubernetes.io/cluster/demo" = "owned"
          + "kubernetes.io/role/elb"     = "1"
        }
      + tags_all                                       = {
          + "Name"                       = "main-module-public-eu-central-1a"
          + "kubernetes.io/cluster/demo" = "owned"
          + "kubernetes.io/role/elb"     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.96.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                       = "main-module-public-eu-central-1b"
          + "kubernetes.io/cluster/demo" = "owned"
          + "kubernetes.io/role/elb"     = "1"
        }
      + tags_all                                       = {
          + "Name"                       = "main-module-public-eu-central-1b"
          + "kubernetes.io/cluster/demo" = "owned"
          + "kubernetes.io/role/elb"     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "main-module"
        }
      + tags_all                             = {
          + "Name" = "main-module"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_region.current: Reading...
module.eks_blueprints.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Reading...
module.eks_blueprints.data.aws_caller_identity.current: Reading...
module.eks_blueprints.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Read complete after 1s [id=177172943105]
module.eks_blueprints.data.aws_caller_identity.current: Read complete after 1s [id=177172943105]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Read complete after 1s [id=177172943105]
module.eks_blueprints.data.aws_iam_session_context.current: Reading...
module.eks_blueprints.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::177172943105:user/TerraformUser]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Reading...
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Read complete after 0s [id=586368890]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_blueprints.data.aws_eks_cluster.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks_blueprints.data.http.eks_cluster_readiness[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "eks_cluster_readiness" {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 600
      + url              = (known after apply)
    }

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/created-by" = "terraform-aws-eks-blueprints"
              + "app.kubernetes.io/managed-by" = "terraform-aws-eks-blueprints"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-module-private-eu-central-1a"
        }
      + tags_all                                       = {
          + "Name" = "main-module-private-eu-central-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "main-module-private-eu-central-1b"
        }
      + tags_all                                       = {
          + "Name" = "main-module-private-eu-central-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "main-module"
        }
      + tags_all                             = {
          + "Name" = "main-module"
        }
    }

  # module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "demo"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + version                   = "1.25"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "demo-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "demo-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "demo-cluster-role"
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "demo-cluster-role"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-cluster"
        }
      + tags_all               = {
          + "Name" = "demo-cluster"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                       = "demo-node"
          + "kubernetes.io/cluster/demo" = "owned"
        }
      + tags_all               = {
          + "Name"                       = "demo-node"
          + "kubernetes.io/cluster/demo" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after appl
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.